---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.FailureMessageKey
source: html/842251c5-afcf-25aa-2a60-a08b9a8e0eac.htm
---
# FailureMessageKey Members

Constructs a new FailureMessageKey with default settings.